app/controllers/items_controller.rb

  def index
    @items = @current_user.items.all(:order => 'created_at ASC')

    for item in @items

    	if ((Time.now-item.created_at)/86400).to_int >= 30 then

    		item.old = true
    		item.save
---
SELECT * FROM "items" WHERE ("items"."created_at" = 'ciao') AND ("items".user_id = 1)
UPDATE "items" SET "updated_at" = '2009-09-06 20:55:03', "old" = 'f' WHERE "id" = 95

  def show
    @item = @current_user.items.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1 AND ("items".user_id = 1))

  def new

   	 	@item = @current_user.items.new
    	@item.name = params[:t]
    	@item.notes = "Click here to add a note"
    	@item.url = params[:u]

    	@item.save
---
INSERT INTO "items" ("name", "updated_at", "url", "notes", "created_at") VALUES('Converse Chuck Taylor Allstar Canvas Hi-top mono: Amazon.co.uk: Shoes & Accessories', '2009-08-09 14:34:26', 'http://www.amazon.co.uk/gp/product/B000OYM0SW/ref=s9_simz_gw_s0_p309_i2?pf_rd_m=A3P5ROKL5A1OLE&pf_rd_s=center-1&pf_rd_r=0B2XRNR3HS5RB0H3JNTP&pf_rd_t=101&pf_rd_p=467198433&pf_rd_i=468294', '<blank...for now>', '2009-08-09 14:34:26')

  def edit
    @item = @current_user.items.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 54)

  def create
    @item = @current_user.items.new(params[:item])
    @item.name = params[:t]
    @item.notes = "<blank...for now>"
    @item.url = params[:u]

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "updated_at", "url", "notes", "created_at") VALUES('Converse Chuck Taylor Allstar Canvas Hi-top mono: Amazon.co.uk: Shoes & Accessories', '2009-08-09 13:58:33', 'http://www.amazon.co.uk/gp/product/B000OYM0SW/ref=s9_simz_gw_s0_p309_i2?pf_rd_m=A3P5ROKL5A1OLE&pf_rd_s=center-1&pf_rd_r=0B2XRNR3HS5RB0H3JNTP&pf_rd_t=101&pf_rd_p=467198433&pf_rd_i=468294', '<blank...for now>', '2009-08-09 13:58:33')

  def delete
    @item = @current_user.items.find(params[:id])
    @item.destroy
---
SELECT * FROM "items" WHERE ("items".user_id = 1) ORDER BY created_at ASC
DELETE FROM "items" WHERE "id" = 17