app/controllers/items_controller.rb

SELECT * FROM "items" WHERE ("items"."id" = 1 AND ("items".user_id = 1))
DELETE FROM "items" WHERE "id" = 19
---
  def destroy
    @item = @current_user.items.find(params[:id])
    @item.destroy