app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('098ca5b6a7c746eb8689a81f7818847175eeca3b', '2009-08-16 16:56:35', 'b097c90240d60f1404d31c4fb88c5054f6700c05', NULL, NULL, 'stefano', 'stefano@mail.com', '2009-08-16 16:56:35')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save